tests/src/serviceTest/resources/request/consultationDroits/v3/18_benef_multi_contrat_request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns5:getInfoBddRequest xmlns="http://norme.cegedimassurances.com/commun" xmlns:ns2="http://norme.cegedimassurances.com/base_de_droit" xmlns:ns3="http://norme.cegedimassurances.com/beneficiaire" xmlns:ns4="http://norme.cegedimassurances.com/amc" xmlns:ns5="http://ws.cegedimassurance.com/basededroit/wsdl">
            <ns2:header_in>
                <headerTech>
                    <id_logiciel_client>ALLIANCE PREMIUM</id_logiciel_client>
                    <version_logiciel_client>V201_15_07</version_logiciel_client>
                    <id_session_serveur>107f4d8a-04ee-4909-8b7b-390700ba61cd</id_session_serveur>
                </headerTech>
                <headerFonc>
                    <code_contexte>CD-01</code_contexte>
                    <delivrance_accreditation>1</delivrance_accreditation>
                    <code_proprietaire>0000452433</code_proprietaire>
                </headerFonc>
            </ns2:header_in>
            <ns2:beneficiaire>
                <ns3:NIR_certifie>1650431555715</ns3:NIR_certifie>
                <ns3:cle_NIR>64</ns3:cle_NIR>
                <ns3:date_naissance>19650429</ns3:date_naissance>
                <ns3:rang_gemellaire>1</ns3:rang_gemellaire>
            </ns2:beneficiaire>
            <ns2:amc>
                <ns4:nom>CCMO</ns4:nom>
                <ns4:adherent>000000180</ns4:adherent>
                <ns4:numero_AMC_prefectoral>0000452433</ns4:numero_AMC_prefectoral>
            </ns2:amc>
            <ns2:info_bdd>
                <ns2:type_recherche_benef>0</ns2:type_recherche_benef>
                <ns2:type_recherche_segment>1</ns2:type_recherche_segment>
                <ns2:type_segment_recherche>PHAR</ns2:type_segment_recherche>
                <ns2:type_profondeur_recherche>0</ns2:type_profondeur_recherche>
            </ns2:info_bdd>
            <ns2:dates>
                <date_reference>2020-03-31</date_reference>
                <type_date_reference>3</type_date_reference>
            </ns2:dates>
        </ns5:getInfoBddRequest>
    </soap:Body>
</soap:Envelope>
